<?php

declare(strict_types=1);

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Cache;

final class DatabaseSeeder extends Seeder
{
    public function run(): void
    {
        Cache::flush();

        Product::create([
            'title' => '🍯 Дикий Мёд 🍯',
            'description' => 'Этот мёд собран в глухих уголках филиппинских джунглей, куда редко ступает нога человека. Местные пчёлы создают его из нектара диких тропических цветов, что придаёт вкусу особенную глубину и насыщенность. У него густая текстура, тёплый золотистый цвет и аромат, напоминающий о влажном лесе, цветущих лианах и древесной смоле. Это чистый, натуральный продукт природы, который сохранил в себе дикий дух Филиппин.',
            'price' => '2000',
        ])->addMedia(
            public_path('assets/images/honey.jpg')
        )->preservingOriginal()->toMediaCollection('image');

        Product::create([
            'title' => '🥚 Яйца Валерия 🥚',
            'description' => '"У Валерия ахуенные яйца. Очень вкусные, всем советую. 

И другие покупатели не врут: из-за яиц Валерия реально каменный стояк. Кстати, вот в России везде где смотрел — у всех яйца малюсенькие, а яйца Валерия довольно крупные. 

Единственный минус, что теперь не могу представить, что могу довольствоваться какими то другими яйцами.

Так что, если кто-то хочет настоящие яйца, то попросите у Валерия и он вам даст, причём за очень дружескую цену."',
            'price' => '2000',
        ])->addMedia(
            public_path('assets/images/eggs.jpg')
        )->preservingOriginal()->toMediaCollection('image');
    }
}
